jlcbk/codex-desk-terminal/firmware/sdkconfig.defaults
# P4.2 sdkconfig.defaults — 关键配置按 P4.1a 真机验证值锁定
# 证据：artifacts/idf/sdkconfig-significant-diff.txt、artifacts/board/p41c-summary.md
# （16MB Flash QIO、PSRAM Octal 80MHz、UART0 主控制台 + USB-Serial-JTAG secondary、CPU 160MHz）
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_HZ=1000

# wqy 点阵落地（A2，2026-09-11）：全量 wqy 单字体 ~1.8MB 进 app，factory 1M 不足。
# 16MB flash、无 OTA 诉求（A0 授权）→ 自定义分区表 factory 1M→4M（约 30% 余量）。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
